[
  {
  "id": "001",
  "title": "Transparent Tribe deploys new remote access trojan in targeted attacks",
  "icon": "fa-bug",
  "category": "malware",
  "risk": "high",
  "location": "South Asia",
  "date": "2026-01-02",
  "summary": "A known threat group has launched a new remote access trojan capable of spying, file theft, and persistent system control.",
  "points": [
    "Targets specific individuals and organizations",
    "Malware provides full remote control",
    "Designed to evade basic detection"
  ]
  },

{
  "id": "002",
  "title": "Cloud phishing campaign abuses Google Cloud email feature",
  "icon": "fa-envelope",
  "category": "email",
  "risk": "medium",
  "location": "Global",
  "date": "2026-01-02",
  "summary": "Cybercriminals abused Google Cloud’s email integration to send thousands of phishing emails that bypass traditional filters and steal credentials.",
  "points": [
    "Attack used legitimate Google Cloud automation to send phishing emails",
    "Nearly 9,400 emails sent to over 3,200 organizations",
    "Campaign leverages trusted domains to bypass DMARC/SPF"
  ]
},

{
  "id": "003",
  "title": "RondoDox botnet exploits critical React2Shell flaw",
  "icon": "fa-network-wired",
  "category": "botnet",
  "risk": "high",
  "location": "Global",
  "date": "2026-01-01",
  "summary": "The RondoDox botnet has been exploiting a critical remote code execution flaw in React Server Components (React2Shell) to hijack IoT devices and web servers, enrolling them into malware and crypto-miner deployments.",
  "points": [
    "Botnet abuses a critical Next.js vulnerability for unauthenticated code execution",
    "Over 90,000 exposed systems remain vulnerable worldwide",
    "Payloads include cryptominers, bot loaders, and Mirai variants"
  ]
},

{
  "id": "004",
  "title": "Trust Wallet Chrome extension hack causes $7M in crypto losses",
  "icon": "fa-wallet",
  "category": "crypto",
  "risk": "high",
  "location": "Global",
  "date": "2025-12-26",
  "summary": "A malicious update of the Trust Wallet Chrome extension led to the theft of around $7 million in cryptocurrency from users, prompting urgent patching and reimbursements.",
  "points": [
    "Supply-chain compromise of extension version 2.68 injected malicious code",
    "Attackers exfiltrated wallet seed phrases and drained funds",
    "Trust Wallet urged immediate update to version 2.69"
  ]
},

{
  "id": "005",
  "title": "DarkSpectre browser extension campaigns exposed worldwide",
  "icon": "fa-browser",
  "category": "browser-extension",
  "risk": "high",
  "location": "Global",
  "date": "2025-12-31",
  "summary": "A sophisticated threat actor has run malicious browser extension campaigns over years, affecting millions of Chrome, Edge, and Firefox users to harvest data and corporate intelligence.",
  "points": [
    "Multiple campaigns (ShadyPanda, GhostPoster, Zoom Stealer) linked to a single threat actor",
    "Collects browsing data, hijacks affiliate links, and steals corporate meeting intelligence",
    "Over 8.8 million browser users impacted across Chrome, Edge, and Firefox"
  ]
},

{
  "id": "006",
  "title": "Silver Fox phishing campaign targets Indian taxpayers with ValleyRAT malware",
  "icon": "fa-exclamation-triangle",
  "category": "malware",
  "risk": "high",
  "location": "India",
  "date": "2025-12-30",
  "summary": "The Silver Fox threat actor used income tax–themed phishing emails and fake software sites to install the modular ValleyRAT remote access trojan on Indian users’ systems.",
  "points": [
    "Phishing lures impersonate India’s Income Tax Department",
    "Modular ValleyRAT malware enables persistence and credential theft",
    "Attack chain leverages DLL hijacking and SEO-poisoned download sites"
  ]
},

{
  "id": "007",
  "title": "Fortinet firewalls exposed by active exploitation of critical vulnerabilities",
  "icon": "fa-firewall",
  "category": "vulnerability",
  "risk": "high",
  "location": "Global",
  "date": "2025-12-20",
  "summary": "Threat actors are actively exploiting critical authentication bypass and SSO vulnerabilities in Fortinet firewalls and related products, allowing unauthorized access and configuration exports.",
  "points": [
    "Critical vulnerabilities in FortiOS and related products are exploited in the wild",
    "Unauthenticated attackers can bypass authentication or gain admin access",
    "Exposure of sensitive firewall configurations and network access"
  ]
},

{
  "id": "008",
  "title": "Cognizant hit with class-action lawsuits over TriZetto data breach",
  "icon": "fa-user-shield",
  "category": "data_breach",
  "risk": "medium",
  "location": "United States",
  "date": "2026-01-02",
  "summary": "Cognizant and its subsidiary TriZetto face multiple U.S. class-action lawsuits after a long-running data breach exposed sensitive personal data and delayed notification to victims.",
  "points": [
    "Unauthorized access to TriZetto systems went undetected for nearly a year",
    "Sensitive personal data (SSNs, financial info, addresses) were exposed",
    "Lawsuits allege failure to protect data and delayed breach notifications"
  ]
}






]
