{
  "id": "004",
  "title": "Trust Wallet Chrome extension hack causes $7M in crypto losses",
  "location": "Global",
  "category": "Crypto",
  "risk": "high",
  "date": "December 2025",

  "executive_summary": [
    "The Trust Wallet Chrome browser extension (version 2.68) was compromised, leading to unauthorized draining of user funds totaling approximately $7 million in various cryptocurrencies.",
    "Trust Wallet confirmed the incident and urged affected users to update immediately to version 2.69, confirming reimbursement for losses."
  ],

  "what_happened": [
    "A malicious version (2.68) of the Trust Wallet Chrome browser extension was published — potentially via compromised Web Store credentials — injecting hidden JavaScript that exfiltrated sensitive wallet data.",
    "Users who imported seed phrases or interacted with the compromised extension had their wallets drained as attackers captured credentials and moved funds to external addresses.",
    "Reports indicated losses of roughly $6–7 million across Bitcoin, Ethereum, BNB, Solana, and other chains.",
    "Trust Wallet released a patched version (2.69) and instructed users to stop using the vulnerable version immediately."
  ],

  "who_is_affected": [
    "Users of the Trust Wallet Chrome extension version 2.68.",
    "Self-custody holders who imported seed phrases into the compromised extension.",
    "Crypto users active during the holiday period (Christmas Eve/Day 2025)."
  ],

  "attack_flow": [
    "Compromised extension update (v2.68) released via Chrome Web Store.",
    "Hidden malicious code runs on install or use, capturing seed phrases.",
    "Captured credentials allow the attacker to access wallets and transfer funds.",
    "Funds are drained and moved to external wallets on multiple chains."
  ],

  "business_impact": [
    "Loss of user funds totaling ~ $6–7 million.",
    "Reputational damage and erosion of trust in browser extension wallets.",
    "Emergency patch release and user support overhead."
  ],

  "risk_reason": "Browser extension supply-chain attacks exploit trust in Web Store updates and can capture sensitive input like seed phrases, enabling full wallet compromise.",

  "what_usually_goes_wrong": [
    "Automatic updates introduce malicious code without verification.",
    "Users import seed phrases into compromised software.",
    "Insufficient vetting or protection of extension publishing credentials."
  ],

  "recommended_actions": {
    "immediate": [
      "Disable the affected Trust Wallet Chrome extension version 2.68.",
      "Update immediately to the official fixed version 2.69."
    ],
    "short_term": [
      "Review transaction history and secure remaining funds in offline wallets.",
      "Avoid entering seed phrases into browser extensions."
    ],
    "long_term": [
      "Audit and restrict browser extension use in high-risk environments.",
      "Implement multi-factor safeguards for wallet access beyond seed phrases."
    ]
  },

  "what_this_does_not_mean": [
    "All Trust Wallet products are insecure — only a specific extension version was affected.",
    "The core blockchain protocols were hacked. (This was an extension compromise.)"
  ],

  "monitoring": {
    "signs": [
      "Unexpected outflows from wallets without user authorization.",
      "Installation of unverified browser extensions."
    ],
    "alerts": [
      "Transactions to unfamiliar addresses.",
      "Warnings from on-chain monitoring tools about rapid fund movement."
    ]
  },

  "sources": [
    {
      "title": "The Hacker News",
      "url": "https://thehackernews.com/2025/12/trust-wallet-chrome-extension-bug.html"
    }
  ]
}
